Конфигурация/InformationRegisters/АсинхронныйОбменДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АсинхронныйОбменДанными</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОтвета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСостояния</Name>
					<Comment>Код состояния (ответа), возвращаемый HTTP-сервисом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОтвета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтветаАсинхронногоОбменаДанными</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПакетаВоВнешнейСистеме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПакета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИмпортируемыхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/АсинхронныйОбменДанными/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.АнализируемыйПериод.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
КонецПроцедуры

&НаКлиенте
Процедура КомандаНайти(Команда)
	
	ТекстВопроса = "Для быстрой работы поиска рекомендуется использовать период не больше месяца. Продолжить?";
	ВыбранныйПериод = (ЭтаФорма.АнализируемыйПериод.ДатаОкончания - ЭтаФорма.АнализируемыйПериод.ДатаНачала)/3600/24;
	
	Если Не ПроверитьЗаполнение() Или (ВыбранныйПериод > 31 И Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет) Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыПоиска = Новый Структура("ДатаНачала, ДатаОкончания, РежимПоиска, СтрокаПоиска, ВнешняяСистема, ТипПакета"); 
	ЗаполнитьЗначенияСвойств(ПараметрыПоиска, ЭтаФорма);
	ЗаполнитьЗначенияСвойств(ПараметрыПоиска, ЭтаФорма.АнализируемыйПериод);
	
	ЭтаФорма.ИсходныеНастройки = Новый ОтборКомпоновкиДанных;
	Для каждого ЭлементПользовательскихНастроек Из ЭтаФорма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементПользовательскихНастроек) = Тип("ОтборКомпоновкиДанных") Тогда
			ЗаполнитьОтбор(ЭтаФорма.ИсходныеНастройки, ЭлементПользовательскихНастроек);
			ЭлементПользовательскихНастроек.Элементы.Очистить();
		КонецЕсли; 
	КонецЦикла; 
	ЭтаФорма.Список.Отбор.Элементы.Очистить();
	
	УстановитьОтборы(ПараметрыПоиска);
	
	Элементы.ГруппаПараметрыПоиска.Заголовок = ПредставлениеПериода(ЭтаФорма.АнализируемыйПериод.ДатаНачала, ЭтаФорма.АнализируемыйПериод.ДатаОкончания) +  
		"; Внешняя система: " + ЭтаФорма.ВнешняяСистема + 
		"; Тип пакета: " + ЭтаФорма.ТипПакета + 
		"; Строка поиска: " + ЭтаФорма.СтрокаПоиска;
	Элементы.КомандаОтменитьПоиск.Доступность = Истина;
	Элементы.ГиперссылкаОтменитьПоиск.Видимость = Истина;
	
	Элементы.ГруппаПараметрыПоиска.Скрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменитьПоиск(Команда)
	
	Элементы.КомандаОтменитьПоиск.Доступность = Ложь;
	Элементы.ГиперссылкаОтменитьПоиск.Видимость = Ложь;
	Элементы.ГруппаПараметрыПоиска.Заголовок = "Поиск по содержимому";
	
	ЭтаФорма.Список.Отбор.Элементы.Очистить();
	Если ТипЗнч(ЭтаФорма.ИсходныеНастройки) = Тип("ОтборКомпоновкиДанных") Тогда
		ЭлементНастроек = Неопределено;
		Для каждого ЭлементПользовательскихНастроек Из ЭтаФорма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если ТипЗнч(ЭлементПользовательскихНастроек) = Тип("ОтборКомпоновкиДанных") Тогда
				ЭлементНастроек = ЭлементПользовательскихНастроек;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
		Если ЭлементНастроек = Неопределено Тогда
			ЭлементНастроек = ЭтаФорма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
		КонецЕсли; 
		ЗаполнитьОтбор(ЭлементНастроек, ЭтаФорма.ИсходныеНастройки);
	КонецЕсли; 
	
	Элементы.ГруппаПараметрыПоиска.Скрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборы(ПараметрыПоиска)

	ЭлементОтбора = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаЗапроса");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = ПараметрыПоиска.ДатаНачала;

	ЭлементОтбора = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаЗапроса");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = ПараметрыПоиска.ДатаОкончания;
	
	ЭлементОтбора = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВнешняяСистема");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ПараметрыПоиска.ВнешняяСистема;
	
	ЭлементОтбора = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипПакета");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ПараметрыПоиска.ТипПакета;
	
	ЭлементОтбора = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УникальныйИдентификатор");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = ПолучитьМассивУИДов(ПараметрыПоиска);;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ЗаполнитьОтбор(Приемник, Источник) 
	
	Для каждого ЭлементОтбора Из Источник.Элементы Цикл
		
		НовыйОтбор = Приемник.Элементы.Добавить(ТипЗнч(ЭлементОтбора));
		ЗаполнитьЗначенияСвойств(НовыйОтбор, ЭлементОтбора);
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
		
			ЗаполнитьОтбор(НовыйОтбор, ЭлементОтбора);
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивУИДов(ПараметрыПоиска)

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АсинхронныйОбменДанными.ВнешняяСистема КАК ВнешняяСистема,
		|	АсинхронныйОбменДанными.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	АсинхронныйОбменДанными.ТипПакета КАК ТипПакета
		|ИЗ
		|	РегистрСведений.АсинхронныйОбменДанными КАК АсинхронныйОбменДанными
		|ГДЕ
		|	АсинхронныйОбменДанными.ВнешняяСистема = &ВнешняяСистема
		|	И АсинхронныйОбменДанными.ТипПакета = &ТипПакета
		|	И АсинхронныйОбменДанными.ДатаЗапроса МЕЖДУ &ДатаНачала И &ДатаОкончания";
	Запрос = Новый Запрос(ТекстЗапроса);
	Для каждого Параметр Из ПараметрыПоиска Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивУИДов = Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.АсинхронныйОбменДанными.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Прочитать();
		
		Текст = "";
		
		Если ПараметрыПоиска.РежимПоиска = 0 Или ПараметрыПоиска.РежимПоиска = 1 Тогда
			Текст = Строка(Запись.ТекстЗапроса.Получить());
		КонецЕсли; 
		
		Если ПараметрыПоиска.РежимПоиска = 0 Или ПараметрыПоиска.РежимПоиска = 2 Тогда
			Текст = Текст + Символы.ПС + Строка(Запись.ТекстОтвета.Получить());
		КонецЕсли; 
		
		Если СтрНайти(Текст, ПараметрыПоиска.СтрокаПоиска) > 0 Тогда
			МассивУИДов.Добавить(Выборка.УникальныйИдентификатор);
		КонецЕсли;
	
	КонецЦикла; 
	
	Возврат МассивУИДов;

КонецФункции

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Отказ = Элементы.ГруппаПараметрыПоиска.Скрыта();
	
	Если Не Отказ Тогда
	
		ПроверяемыеРеквизиты.Добавить("АнализируемыйПериод");
		ПроверяемыеРеквизиты.Добавить("ВнешняяСистема");
		ПроверяемыеРеквизиты.Добавить("ТипПакета");
		ПроверяемыеРеквизиты.Добавить("СтрокаПоиска");
	
	КонецЕсли; 
		//Отказ = Отказ Или Не (ЗначениеЗаполнено(ЭтаФорма.АнализируемыйПериод) 
		//И ЗначениеЗаполнено(ЭтаФорма.ВнешняяСистема) 
		//И ЗначениеЗаполнено(ЭтаФорма.ТипПакета)
		//И ЗначениеЗаполнено(ЭтаФорма.СтрокаПоиска));
	
КонецПроцедуры
